{
    "data": [
        {
          "id": 1,
          "answer": "Amazon EC2 instances can be launched on demand when needed.",
          "explanation": "The ability to launch instances on demand when needed allows users to launch and terminate instances in response to a varying workload. This is a more economical practice than purchasing enough on-premises servers to handle the peak load.",
          "questionId": 1
        },
        {
          "id": 2,
          "answer": "AWS Database Migration Service (AWS DMS)",
          "explanation": "AWS DMS helps users migrate databases to AWS quickly and securely. The source \r\n atabase remains fully operational during the migration, minimizing downtime to applications that rely on the database. AWS DMS can migrate data to and from most widely used commercial and open-source databases.",
          "questionId": 2
        },
        {
          "id": 3,
          "answer": "AWS Marketplace",
          "explanation": "AWS Marketplace is a digital catalog with thousands of software listings from independent software vendors that makes it easy to find, test, buy, and deploy software that runs on AWS",
          "questionId": 3
        },
        {
          "id": 4,
          "answer": "Amazon Virtual Private Cloud (Amazon VPC)",
          "explanation": "Amazon VPC lets users provision a logically isolated section of the AWS Cloud where users can launch AWS resources in a virtual network that they define.",
          "questionId": 4
        },
        {
          "id": 5,
          "answer": "Maintaining physical hardware",
          "explanation": "Maintaining physical hardware is an AWS responsibility under the AWS shared responsibility model.",
          "questionId": 5
        },
        {
          "id": 6,
          "answer": "AWS Regions",
          "explanation": "To deliver content to users with lower latency, Amazon CloudFront uses a global network of points of presence (edge locations and regional edge caches) worldwide.",
          "questionId": 6
        },
        {
          "id": 7,
          "answer": "Enable multi-factor authentication",
          "explanation": "Multi-factor authentication (MFA) is a simple best practice that adds an extra layer of protection on top of a username and password. With MFA enabled, when a user signs in to an AWS Management Console, they will be prompted for their username and password (the first factor- what they know), as well as for an authentication code from their MFA device (the second factor-what they have). Taken together, these multiple factors provide\r\nincreased security for AWS account settings and resources.",
          "questionId": 7
        },
        {
          "id": 8,
          "answer": "AWS CloudTrail",
          "explanation": "AWS CloudTrail helps users enable governance, compliance, and operational and risk auditing of their AWS accounts. Actions taken by a user, role, or an AWS service are recorded as events in CloudTrail. Events include actions taken in the AWS Management Console, AWS Command Line Interface (CLI), and AWS SDKs and APIs.",
          "questionId": 8
        },
        {
          "id": 9,
          "answer": "Which service would be used to send alerts based on Amazon CloudWatch alarms?",
          "explanation": "Amazon SNS and Amazon CloudWatch are integrated so users can collect, view, and analyze metrics for every active SNS. Once users have configured CloudWatch for Amazon SNS, they can gain better insight into the performance of their Amazon SNS topics, push notifications, and SMS deliveries.",
          "questionId": 9
        },
        {
          "id": 10,
          "answer": "AWS Acceptable Use Policy",
          "explanation": "The AWS Acceptable Use Policy provides information regarding prohibited actions on the AWS infrastructure.",
          "questionId": 10
        }
      ]
      
}